# Дана строка. Преобразовать в ней все прописные латинские буквы в строчные

# -> Тест СТРОКА
# <- тест строка

Str = input("Enter string: ")
print(Str.lower())

# _________________________________________________________________________________________

# Дана строка-предложение на русском языке. Преобразовать строку так, чтобы каждое слово начиналось с заглавной буквы.
# Словом считать набор символов, не содержащий пробелов и ограниченный пробелами или началом/концом строки.
# Слова, не начинающиеся с буквы, не изменять.

# -> тест строка
# <- Тест Строка

Str = input("Enter string: ")
print(Str.title())
